# Pandas Week 12

# 45. Memadukan loc dan iloc untuk seleksi data pada Data Frame

In [1]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [2]:
#data frame prep
df=pd.read_csv('./datasets/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Memadukan loc and iloc untuk melakukan seleksi data

- ruas kiri di iloc dan loc berkolerasi dengan baris dan ruas kanannya berkolerasi dengan kolom
- untuk kasus kali ini kita akan memanfaatkan iloc untuk menyeleksi baris saja  dan loc untuk menyeleksi kolom saja
- urutan penempatan method atau fungsi loc dan iloc tidak mempengaruhi hasil

In [3]:
df.iloc[15:20, :].loc[:, 'name':'age']

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

In [4]:
df.loc[:, 'name':'age'].iloc[15:20, :]

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

# 46. Seleksi weekdays dan weekends pada data deret waktu

In [5]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [7]:
#data frame prep
n_rows = 365
n_cols = 2
cols=['col1','col2']
df=pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
               columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df

            col1  col2
2000-01-01    16     4
2000-01-02    17    14
2000-01-03     2     2
2000-01-04     2     8
2000-01-05     1     3
...          ...   ...
2000-12-26     1    10
2000-12-27     6     9
2000-12-28    14    18
2000-12-29    18    16
2000-12-30    17    15

[365 rows x 2 columns]

# Seleksi weekdays dan weekends

In [9]:
weekdays_df = df[df.index.dayofweek.isin([0,1,2,3,4])]
weekdays_df.head(7)

            col1  col2
2000-01-03     2     2
2000-01-04     2     8
2000-01-05     1     3
2000-01-06    13     6
2000-01-07     7     2
2000-01-10    19     7
2000-01-11     8     2

In [10]:
weekdays_df = df[df.index.dayofweek.isin([5,6])]
weekdays_df.head(7)

            col1  col2
2000-01-01    16     4
2000-01-02    17    14
2000-01-08     7    15
2000-01-09     6     5
2000-01-15     3     5
2000-01-16    11    13
2000-01-22     6    15

note: 
- attribute 'df.index.dayofweek' hanya bisa diakses dengan catatan kalau memang data Frame kita merupakan time series (index berupa date time)
- indeks ke 0 sampai 4 adalah hari senin sampai jumat
- indeks ke 5 dan 6 adalah hari sabtu dan minggu

# 47. Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

In [11]:
 #import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [16]:
#data frame prep
d= {'nama':['Jake','Tyson','Peter','Nate','Luke'],
    'ipk':[2,'3',3,2.75,'3.25']}
            
df= pd.DataFrame(d)
df

    nama   ipk
0   Jake     2
1  Tyson     3
2  Peter     3
3   Nate  2.75
4   Luke  3.25

# Deteksi dan Penanganan Kolom dengan Tipe data Beragam (Mixed Data Types)

In [18]:
df.dtypes

nama    object
ipk     object
dtype: object

In [19]:
df['ipk'].apply(type)

0      <class 'int'>
1      <class 'str'>
2      <class 'int'>
3    <class 'float'>
4      <class 'str'>
Name: ipk, dtype: object

In [20]:
df['ipk'].apply(type).value_counts()

<class 'str'>      2
<class 'int'>      2
<class 'float'>    1
Name: ipk, dtype: int64

In [23]:
df['ipk']=df['ipk'].astype(float)

In [24]:
df['ipk'].apply(type).value_counts()

<class 'float'>    5
Name: ipk, dtype: int64

note:
- apply(type) digunakan untuk melihat mixed data types pada soatu kolom (untuk kasus ini kita akan melihat mixed data types pada kolom ipk
- value_counts() digunakan untuk melihat banyaknya suatu tipe data dalam suatu kolom
- astype() digunakan untuk meruah type data

# 48. Cummulative Count pada Pandas Data Frame

In [26]:
 #import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [27]:
#data frame prep
d={'penjual': ['Max','John','Jesse','Alexis','Bruce','Jack','Paulie','Daniel'],
   'barang':['monitor','monitor','keyboard','mouse','keyboard','monitor','laptop','monitor']}
df=pd.DataFrame(d);
df

  penjual    barang
0     Max   monitor
1    John   monitor
2   Jesse  keyboard
3  Alexis     mouse
4   Bruce  keyboard
5    Jack   monitor
6  Paulie    laptop
7  Daniel   monitor

# Mengenal Cummulative Count dengan cumcount()

- Cummulative Count() digunakan penjumlahan baris (kemunculan nilai)

In [32]:
df['count_tiap_penjual']=df.groupby('penjual').cumcount() +1
df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,Max,monitor,1,1,1
1,John,monitor,1,2,1
2,Jesse,keyboard,1,1,1
3,Alexis,mouse,1,1,1
4,Bruce,keyboard,1,2,1
5,Jack,monitor,1,3,1
6,Paulie,laptop,1,1,1
7,Daniel,monitor,1,4,1

In [33]:
df['count_tiap_barang']=df.groupby('barang').cumcount() +1
df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,Max,monitor,1,1,1
1,John,monitor,1,2,1
2,Jesse,keyboard,1,1,1
3,Alexis,mouse,1,1,1
4,Bruce,keyboard,1,2,1
5,Jack,monitor,1,3,1
6,Paulie,laptop,1,1,1
7,Daniel,monitor,1,4,1

In [34]:
df['count_pasangan_kolom']=df.groupby(['penjual','barang']).cumcount() +1
df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,Max,monitor,1,1,1
1,John,monitor,1,2,1
2,Jesse,keyboard,1,1,1
3,Alexis,mouse,1,1,1
4,Bruce,keyboard,1,2,1
5,Jack,monitor,1,3,1
6,Paulie,laptop,1,1,1
7,Daniel,monitor,1,4,1

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5